##::::: :::::'###::::'########:::::'###:::::::::::::'########:
##:::::::::'## ##::: ##.... ##:::'## ##:::::::::::: ##.....::
##::::::::'##:. ##:: ##:::: ##::'##:. ##::::::::::: ##:::::::
##:::::::'##:::. ##: ########::'##:::. ##:'#######: #######::
##::::::: #########: ##.... ##: #########:........:...... ##:
##::::::: ##.... ##: ##:::: ##: ##.... ##::::::::::'##::: ##:
########: ##:::: ##: ########:: ##:::: ##::::::::::. ######::
#.......::..:::::..::........:::..:::::..::::::::::::......:::
#5.1
def p1():
    l=[1,2,3,5,7]
    k=int(input("Введите предпологаемое число в списке -"))
    if k in l:
        print('Ваше число',k)
        print(l,"Такое число есть в этом списке")
    else:
        print('Нет такого числа в списке нет', l,"ваше число",k)
#5.2
def p2():
    b = []
    a = [1, 2, 4, 6, 5, 4, 1, 7, 2,8]
    result = dict((i, a.count(i)) for i in a)
    print(a)
    print (result)
#5.3
def p3():
    a = int(input("Введите сколько вы хотите выходных на неделе: "))
    d = ("понедельник", "вторник", "среда", "четверг", "пятница", "суббота", "воскресенье")
    for j in d:
        print("Ваши выходные дни: ", *d[-a:])
        print("Ваши рабочие дни: ", *d[:-a])
        break
5.4
def p4():
    import random
    md5 = ["Яриз", "Соболева", "Зимина", "Пархомец", "Кельштейн", "Кашицына", "Марченко", "Скрипилова", "Капустинский", "Заяц"]
    md8 = ["Степанова", "Иванов", "Сальников", "Данилов", "Мешков", "Маскалёв", "Запарожец", "Гридасова", "Иванов", "Семенченко"]
    a1 = []
    a2 = []
    a = []
    a1.append(random.sample(md5, 5))
    a2.append(random.sample(md8, 5))
    a.extend(*a1)
    a.extend(*a2)
    a = tuple(a)
    print("Исходный список: ", *md5)
    #список первой группы
    print("Исходный список: ", *md8)
    #список второй группы
    print('a', *a)
    #команда
    print('b', len(a))
    #длинна группы
    print('d', *sorted(a))
    #по алфавиту
    print('e', 'Иванов' in a)
    print('e', a.count('Иванов)'))
#сколькро встречается фамилия иванов
p2()
